## oprations

In [2]:
# Create database dbname ; => Create new database

In [ ]:
#  show databases; => show all databases

In [28]:
#  use database dbname; => choice our data base

In [ ]:
#  drop database dbname; => delete database

In [40]:
#  create tabe tbname (id int ,name varchar(20)); => create new table

In [ ]:
#  desc tbname ; => table info

In [9]:
#  Insert into tbname values (1,"Jay") => add items in table

In [ ]:
#  select* from name order by name; => whatch data using soreting name

In [10]:
# update name set name = "zeel" where id = 5; => uodate name and any row data

In [ ]:
#  truncate table tbname ; => delete only tables data not a table

In [ ]:
#  delete from tbname where age = "21"; => delete row where age is 21

In [ ]:
# alter table name add roll varchar(20) Unique; => Chnage and Add Column

In [3]:
# select distinct id *from table_name where id is not None  # here we get not null id and also using(distinct) we have not repated id

In [29]:
#  desc tbname ; => Structure of tbale

In [25]:
 # select*from name where name like "A%"; => deispya data where name starting with A

## Aggregate functions

Aggregate functions in MySQL are used to calculate a set of values and return a single value as a result. 
COUNT, SUM, AVG, MIN, MAX, FIRST, LAST, and GROUP_CONCAT. 
Aggregate functions can be used with or without the GROUP BY clause.

In [23]:
 # select count(name) as total from name ; => total count of name data and save in table total

In [24]:
# select count(name) as total from name where name = "Jay"; => count of data where name is Jay

In [26]:
# select max(id) from name ; => get max an min number of id

# sub query

In [1]:
# koy query ni andar koy query use karva pade tene sub query kevay

In [2]:
# select name,age,(select avg(age)  from table_name) as avg_age from  table_name ;

## Constrains in mysql

In [42]:
 # Not Null  unique  default check foreign key primary key

In [43]:
# not null => column data are not null values ,

In [44]:
#  unique => evry data are unique and also null value

In [46]:
# check => if we need to some constrain to inserting data then check option use , if we need only 18 abov age the we use chack (age>18)

## Keys

In [31]:
# Unique key => evry data are not save , they are null but not same with other collation

In [32]:
# Primary key => They are conatine also unique values but they are not null and also useing primary key we use those data in somewhere

In [33]:
#  Foreign key => we use as as linked key like we link primary key with foreign key and link to gether tables

## Joins

In [34]:
#  Inner Join => only get same data in both tables

In [36]:
# left Outer join =>

In [37]:
# Righ outer join => combine  all data of right side table and only  have link data of left side

In [ ]:
#  Cross Join => All data are cobinate with each other and all posibales are generate

In [38]:
# select name.name,roll.roll from name inner join roll on roll.roll = name.roll; => connect two tables where id is same

In [39]:
# select name.name,roll.roll from name cross join roll; => name darek roll npo sathe cross thase je not null value hoy ena sathe

# dat time Function in MYSQL

In [1]:
# select current_timestamp()
# select now();

In [2]:
# select year("2001/02/05");
# YEAR | MONTH | WEEK | DAY | HOUR | MINUTE | DOW | DOY | (day of week and year)

## Data base connection with Python

In [52]:
import mysql.connector

In [53]:
cnx = mysql.connector.connect(user='root', password='Root36Jay',
                              host='localhost',
                              database='jay')

In [54]:
db = cnx.cursor()

In [55]:
db.execute("show databases;")
dbs = db.fetchall()

In [56]:
dbs

[('information_schema',),
 ('jay',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('schooltest',),
 ('sys',),
 ('test',)]

In [57]:
# db.execute("show databases;") => pass eny quaery in execute function

In [58]:
#  if we insert some data then we need commit our data in data base ;